# Downloaded from https://github.com/autopkg/joshua-d-miller-recipes/blob/8a1767feebc676e376cc661d05f092c654217ce1/Mendeley/Mendeley.munki.recipe
# Commit: 8a1767feebc676e376cc661d05f092c654217ce1
# Downloaded at: 2025-11-27 22:31:18 UTC

Description: Download the latest version of Mendeley and imports it into Munki.
Identifier: com.github.joshua-d-miller.autopkg.munki.Mendeley
Input:
  MUNKI_REPO_SUBDIR: apps/mendeley
  NAME: Mendeley Desktop
  pkginfo:
    catalogs:
    - testing
    category: Reference
    developer: Elsevier
    description: Mendeley is a free reference manager and academic social network that can help you organize your research, collaborate with others online, and discover the latest research. - http://www.mendeley.com
    name: '%NAME%'
    postinstall_script: "#!/bin/bash\n# Microsoft Word 2016/2019 Plugin for Mendeley\n# Updated December 6, 2018 - Andrew Valentine\n# Copy Mendeley plugin to user plugin directory\n\nif [ -e /Applications/Microsoft\\ Word.app ]; then\n\techo \"Microsoft Word found. Proceeding to setup Mendeley plugin if required.\"\n\telse echo \"Microsoft Word not found. Nothing more to do.\"\n\texit 0\nfi\n\n# Get logged in user\n\nloggedInUser=$(/usr/bin/python -c 'from SystemConfiguration import SCDynamicStoreCopyConsoleUser; import sys; username = (SCDynamicStoreCopyConsoleUser(None, None, None) or [None])[0]; username = [username,\"\"][username in [u\"loginwindow\", None, u\"\"]]; sys.stdout.write(username + \"\\n\");')\n\n# Get Mendeley version\n\nmendeleyVersion=`(/usr/bin/defaults read /Applications/Mendeley\\ Desktop.app/Contents/Info.plist CFBundleShortVersionString)`\n\n# Get plugin versions and paths\n\nappPlugin=`(/bin/ls /Applications/Mendeley\\ Desktop.app/Contents/Resources/macWordPlugin/word2016/)`\npathToAppPlugin=/Applications/Mendeley\\ Desktop.app/Contents/Resources/macWordPlugin/word2016/$appPlugin\ntargetPlugin=/Users/$loggedInUser/Library/Group\\ Containers/UBF8T346G9.Office/User\\ Content.localized/Startup.localized/Word/$appPlugin\npathToTargetPluginDirectory=/Users/$loggedInUser/Library/Group\\ Containers/UBF8T346G9.Office/User\\ Content.localized/Startup.localized/Word/\n\n# If not already present, copy current Mendeley plugin to user plugin directory\n\nif [ ! -e \"$targetPlugin\" ]; then\n\techo \"No user plugin for Mendeley version $mendeleyVersion installed. Proceeding to install.\"\n\tif [ ! -e \"$pathToTargetPluginDirectory\" ]; then\n\t\t/bin/mkdir -p $pathToTargetPluginDirectory\n\tfi\n\t/bin/cp \"$pathToAppPlugin\" \"$pathToTargetPluginDirectory\"\n\telse echo \"Plugin does not need updating.\"\n\texit 0\nfi"
    display_name: '%NAME%'
    postuninstall_script: "#!/bin/bash\npluginDirectory=\"Library/Group Containers/UBF8T346G9.Office/User Content.localized/Startup.localized/Word\"\nfor user in /Users/*;do\n    if [[ -d \"$user/$pluginDirectory\" ]];then\n        for mendeley_plugin in \"$user/$pluginDirectory\"/Mendeley-word*;do\n            if [[ -e \"$mendeley_plugin\" ]];then\n                echo \"Removing Mendeley Word Plugin: $mendeley_plugin\"\n                rm -rf \"$mendeley_plugin\"\n            fi\n        done\n    fi\ndone"
    unattended_install: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.hansen-m.download.Mendeley
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
