# Downloaded from https://github.com/autopkg/joshua-d-miller-recipes/blob/8a1767feebc676e376cc661d05f092c654217ce1/Mendeley/MendeleyReferenceManager.download.recipe
# Commit: 8a1767feebc676e376cc661d05f092c654217ce1
# Downloaded at: 2025-11-27 22:31:18 UTC

Description: Downloads the latest verison of Mendeley Reference Manager
Identifier: com.github.joshua-d-miller.download.mendeleyreferencemanager
Input:
  NAME: Mendeley Reference Manager
  SEARCH_URL: https://www.mendeley.com/download-reference-manager/macOS
  DOWNLOAD_PART_URL: https://static.mendeley.com/bin/desktop/mendeley-reference-manager
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 11_0_0) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/86.0.4240.193 Safari/537.36 Edg/86.0.622.68
MinimumVersion: 2.0.0
Process:
- Processor: URLTextSearcher
  Arguments:
    url: '%SEARCH_URL%'
    request_headers:
      user-agent: '%USER_AGENT%'
    re_pattern: (?P<Version>\d\.\d{1,3}\.\d-x64\.dmg)
- Processor: URLDownloader
  Arguments:
    url: '%DOWNLOAD_PART_URL%-%Version%'
    filename: '%NAME%.dmg'
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/%NAME%.app'
    requirement: identifier "com.elsevier.mendeley" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "45K89Y5X9B"
