# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/1Password/1Password.download.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:31:30 UTC

Description: Downloads the latest pkg installer of 1Password.
Identifier: com.github.dataJAR-recipes.download.1Password
Input:
  NAME: 1Password
MinimumVersion: 1.1.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: https://downloads.1password.com/mac/1Password.pkg
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    expected_authority_names:
    - 'Developer ID Installer: AgileBits Inc. (2BUA8C4S2C)'
    - Developer ID Certification Authority
    - Apple Root CA
    input_path: '%pathname%'
