# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/1Password/1Password.munki.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:31:30 UTC

Description: Downloads the latest pkg installer of 1Password and imports it into Munki.
Identifier: com.github.dataJAR-recipes.munki.1Password
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: 1Password
  pkginfo:
    blocking_applications:
    - 1Password Browser Helper.app
    - 1Password Helper (Renderer).app
    - 1Password Helper (GPU).app
    - 1Password Launcher.app
    - 1Password Helper (Plugin).app
    - 1Password Updater.app
    - 1Password.app
    - 1Password Helper.app
    catalogs:
    - testing
    description: "The world\u2019s most-loved password manager\n\n1Password is the easiest way to store and use strong passwords. Log in to sites and fill forms securely with a single click."
    developer: AgileBits Inc.
    display_name: 1Password
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: 1.1.0
ParentRecipe: com.github.dataJAR-recipes.download.1Password
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpacked'
    flat_pkg_path: '%pathname%'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpacked/com.1password.1password.pkg/Payload'
    purge_destination: true
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%'
    installs_item_paths:
    - /Applications/1Password.app
- Processor: MunkiPkginfoMerger
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/Applications/1Password.app'
    plist_keys:
      LSMinimumSystemVersion: min_os_ver
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      minimum_os_version: '%min_os_ver%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpacked'
    - '%RECIPE_CACHE_DIR%/Applications'
