# Downloaded from https://github.com/autopkg/grahampugh-recipes/blob/efb3512b57ba07bdf23c9f7f800236911a81b295/DellDisplayAndPeripheralManager/DellDisplayAndPeripheralManager.download.recipe.yaml
# Commit: efb3512b57ba07bdf23c9f7f800236911a81b295
# Downloaded at: 2025-11-27 22:33:00 UTC

Description: Downloads the current version of Dell Display and Peripheral Manager.
Identifier: com.github.grahampugh.recipes.download.DellDisplayAndPeripheralManager
MinimumVersion: "2.3"

Input:
  NAME: Dell Display and Peripheral Manager

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: (?P<url>https:\/\/dl.dell.com\/.*?\/1\/DDPMv(?P<version>.*?).zip)
      url: https://www.dell.com/support/home/en-us/drivers/driversdetails?driverid=ktk2n&oscode=mac1&productcode=dell-display-peripheral-manager

  - Processor: URLDownloader
    Arguments:
      url: "%match%"
      request_headers:
        User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9

  - Processor: EndOfCheckPhase

  - Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: True
    Processor: Unarchiver

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unzip/**/DDPM_Installer.pkg"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%found_filename%"
      expected_authority_names:
        - "Developer ID Installer: Qisda Corp. (76K5J93FY6)"
        - Developer ID Certification Authority
        - Apple Root CA
