# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/GoToMeeting/GoToMeeting.download.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:31:39 UTC

Description: Downloads latest GoToMeeting disk image.
Identifier: com.github.homebysix.download.GoToMeeting
Input:
  NAME: GoToMeeting
MinimumVersion: '1.4'
Process:
- Processor: GoToMeetingURLProvider
- Processor: URLDownloader
  Arguments:
    CHECK_FILESIZE_ONLY: true
    filename: '%NAME%.dmg'
    url: '%url%'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/GoToMeeting.app'
    requirement: identifier "com.logmein.GoToMeeting" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GFNFVT632V
- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/GoToMeeting.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
