# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/ClickShare/ClickShare.munki.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:32:54 UTC

Description: Downloads the latest version of Barco ClickShare and imports into Munki.
Identifier: com.github.dataJAR-recipes.munki.ClickShare
Input:
  NAME: ClickShare
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    catalogs:
    - testing
    category: Applications
    description: ClickShare, wireless presentation and conferencing technology, creates understanding between people by freeing them to interact easily and naturally.
    developer: Barco
    display_name: ClickShare
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.2.9
ParentRecipe: com.github.moofit-recipes.download.ClickShare
Process:
- Processor: DmgCreator
  Arguments:
    dmg_root: '%RECIPE_CACHE_DIR%/ClickShare.app'
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/ClickShare.app'
    - '%RECIPE_CACHE_DIR%/ClickShare.dmg'
