# Downloaded from https://github.com/autopkg/ygini-recipes/blob/4abcf39b4f0f6e857da01a83b9fbf34b443e7b36/PaloAlto/GlobalProtectMac.munki.recipe
# Commit: 4abcf39b4f0f6e857da01a83b9fbf34b443e7b36
# Downloaded at: 2025-11-27 22:27:35 UTC

Description: Imports GlobalProtect into munki.
Identifier: com.github.ygini.munki.GlobalProtect
Input:
  NAME: GlobalProtect
  PLATFORM: mac
  fw_app_bundle_id: com.github.ygini.munki.GlobalProtect
  HOSTNAME: vpn.example.com
  DOWNLOAD_URL: https://%HOSTNAME%/global-protect/getmsi.esp?platform=%PLATFORM%
  pkginfo:
    catalogs:
    - testing
    description: GlobalProtect delivers the protection of next-generation security platform to the mobile workforce in order to stop targeted cyberattacks, evasive application traffic, phishing, malicious websites, command-and-control traffic, and known and unknown threats.
    developer: PaloAlto
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.6.1
ParentRecipe: com.github.peshay.download.GlobalProtect
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    flat_pkg_path: '%pathname%'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/%NAME%/gp.pkg/Payload'
- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents'
    source_path: '%RECIPE_CACHE_DIR%/%NAME%/Contents'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist'
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiImporter
  Arguments:
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
    pkg_path: '%pathname%'
