# Downloaded from https://github.com/autopkg/jps3-recipes/blob/a2dc2f004beee8fce0effd29e01c11365516dc50/Camtasia/Camtasia.munki.recipe
# Commit: a2dc2f004beee8fce0effd29e01c11365516dc50
# Downloaded at: 2025-11-27 22:26:05 UTC

Description: Downloads the Camtasia DMG from the TechSmith web site, and imports into Munki repository. It is assumed that the newest version is the only version on the web page for the application.
Identifier: com.github.jps3.munki.Camtasia
Input:
  NAME: Camtasia
  DISPLAY_NAME: '%NAME%'
  MUNKI_REPO_SUBDIR: DMS/Applications
  pkginfo:
    catalogs:
    - testing
    description: A powerful, yet easy-to-use screen recorder, Camtasia helps you create professional videos without having to be a video pro. Easily record your screen movements and actions, or import HD video from a camera or other source. Customize and edit content on both Mac and Windows platforms, and share your videos with viewers on nearly any device.
    display_name: '%DISPLAY_NAME%'
    name: '%NAME%'
    postinstall_script: "#!/bin/bash\n/Applications/Camtasia\\ 2023.app/Contents/Resources/aceinstaller install --silent\n            "
MinimumVersion: 2.0.0
ParentRecipe: com.github.jps3.download.Camtasia
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    version_comparison_key: CFBundleVersion
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
