# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/Elgato Stream Deck/Elgato Stream Deck.munki.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:26:39 UTC

Description: "Downloads the latest version of Elgato Stream Deck and imports it into Munki.\n\nSet the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.\n\nTo force MunkiImporter to import the pkg, set FORCE_MUNKIIMPORT to a non-empty string."
Identifier: com.github.dataJAR-recipes.munki.Elgato Stream Deck
Input:
  NAME: ElgatoStreamDeck
  MUNKI_REPO_SUBDIR: apps/%NAME%
  DERIVE_MIN_OS: YES
  FORCE_MUNKIIMPORT: ''
  pkginfo:
    catalogs:
    - testing
    description: 'You are creating quality content backed by the best tech on the planet. But you want to do more. With Stream Deck, unleash your creative genius and make waves across Twitch and YouTube. All while focusing on what matters most: your audience.'
    developer: Corsair Memory, Inc
    display_name: Elgato Stream Deck
    name: '%NAME%'
    uninstall_method: uninstall_script
    uninstall_script: "#!/bin/bash\n\n# This uninstall script is taken from the Elagto Stream Deck Uninstaller Package:\n# https://help.elgato.com/hc/en-us/articles/360028232731-Stream-Deck-Uninstall-Procedure-on-macOS\n\n# unload the LaunchAgent\nlaunchctl unload -w /Library/LaunchAgents/com.elgato.StreamDeck.plist > /dev/null 2>&1\nlaunchctl unload -w $HOME/Library/LaunchAgents/com.elgato.StreamDeck.plist > /dev/null 2>&1\n\n# kill the Stream Deck application if it was launched manually\nkillall \"Stream Deck\" > /dev/null 2>&1 || true\n\n# delete previous Stream Deck app (as it may have different name)\nrm -f /Library/LaunchAgents/com.elgato.StreamDeck.plist\nrm -f $HOME/Library/LaunchAgents/com.elgato.StreamDeck.plist\n\n# remove app\nrm -rf \"/Applications/Stream Deck.app\"\nrm -rf \"/Applications/Elgato Stream Deck.app\"\n\n# remove STREAMDECKSHM\nsu - $USER -c \"/bin/rm -rf ~/Library/Caches/STREAMDECKSHM\"\n\n# remove cache\nsu - $USER -c \"/bin/rm -rf ~/Library/Caches/elgato/StreamDeck\"\nsu - $USER -c \"/bin/rm -rf ~/Library/Caches/com.elgato.StreamDeck\"\n\n# remove com.elgato.StreamDeck in Application Support (Profiles, HockeyApp)\nsu - $USER -c \"/bin/rm -rf ~/Library/Application\\ Support/com.elgato.StreamDeck\"\n\n# remove preferences\nsu - $USER -c \"defaults delete com.elgato.StreamDeck\"\nsu - $USER -c \"/bin/rm -rf ~/Library/Preferences/com.elgato.StreamDeck.plist\"\n\n# remove logs\nsu - $USER -c \"/bin/rm -rf ~/Library/Logs/StreamDeck\"\n\n# remove OBS related stuff\nPLUGIN_NAME=\"StreamDeckPlugin\"\n\nOBS_PLUGINS_DIR_V2=\"$HOME/Library/Application Support/obs-studio/plugins\"\nrm -rf \"$OBS_PLUGINS_DIR_V2/$PLUGIN_NAME.plugin\"\n\nOBS_PLUGINS_DIR=\"/Library/Application Support/obs-studio/plugins\"\nrm -rf \"$OBS_PLUGINS_DIR/$PLUGIN_NAME\"\n\nexit 0"
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: '2.7'
ParentRecipe: com.github.dataJAR-recipes.download.Elgato Stream Deck
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/installer_unpack'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/installer_payload/'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/installer_unpack/Stream_Deck.pkg/Payload'
    purge_destination: false
- Processor: FileMover
  Arguments:
    overwrite: 'true'
    source: '%RECIPE_CACHE_DIR%/installer_payload/Applications/Stream Deck.app'
    target: '%RECIPE_CACHE_DIR%/installer_payload/Applications/Elgato Stream Deck.app'
  Comment: "The Stream Deck installer package has a postinstall script that renames the bundled \"Stream Deck.app\" to \"Elgato Stream Deck.app\"\n\nThis ensures we're able to create an installs array that doesn't cause install loops.\n\nFor further info please see https://github.com/autopkg/dataJAR-recipes/issues/270"
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/installer_payload/'
    derive_minimum_os_version: '%DERIVE_MIN_OS%'
    installs_item_paths:
    - /Applications/Elgato Stream Deck.app
- Processor: MunkiPkginfoMerger
- Processor: Versioner
  Arguments:
    input_plist_path: '%destination_path%Applications/Elgato Stream Deck.app/Contents/Info.plist'
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiPkginfoMerger
- Processor: MunkiImporter
  Arguments:
    force_munkiimport: '%FORCE_MUNKIIMPORT%'
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/installer_payload/'
    - '%RECIPE_CACHE_DIR%/installer_unpack/'
