# Downloaded from https://github.com/autopkg/its-unibas-recipes/blob/c5bd8a6d2cafa6e81e67f6aec19d2a11dd77de2c/TableauPrep/TableauPrep.munki.recipe
# Commit: c5bd8a6d2cafa6e81e67f6aec19d2a11dd77de2c
# Downloaded at: 2025-11-27 22:30:07 UTC

Description: "Downloads latest Tableau Prep disk image and imports into Munki.\n\nSet the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it."
Identifier: ch.unibas.its.git.mcs.munki.tableau-prep
Input:
  DERIVE_MIN_OS: YES
  NAME: TableauPrep
  MUNKI_REPO_SUBDIR: apps/%NAME%
  pkginfo:
    blocking_applications:
    - TableauPrep
    catalogs:
    - testing
    description: Tableau Prep is a self-service data preparation tool with Tableau Prep Builder and Prep Conductor.
    display_name: Tableau Prep
    installer_choices_xml:
    - attributeSetting: 1
      choiceAttribute: selected
      choiceIdentifier: com.tableausoftware.desktop.app
    - attributeSetting: 0
      choiceAttribute: selected
      choiceIdentifier: com.tableausoftware.desktopShortcut
    name: '%NAME%'
    unattended_install: true
MinimumVersion: '2.7'
ParentRecipe: ch.unibas.its.git.mcs.download.tableau-prep
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/Tableau Prep Builder.pkg'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%/Applications'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/Tableau App.pkg/payload'
    purge_destination: true
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/%NAME%/Applications/Tableau*.app'
- Processor: MunkiInstallsItemsCreator
  Arguments:
    faux_root: '%RECIPE_CACHE_DIR%/%NAME%'
    installs_item_paths:
    - /Applications/%found_basename%
    version_comparison_key: CFBundleShortVersionString
    derive_minimum_os_version: '%DERIVE_MIN_OS%'
- Processor: MunkiPkginfoMerger
- Processor: PlistReader
  Arguments:
    info_path: '%found_filename%/Contents/Info.plist'
    plist_keys:
      CFBundleShortVersionString: version
- Processor: MunkiPkginfoMerger
  Arguments:
    additional_pkginfo:
      version: '%version%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
    - '%RECIPE_CACHE_DIR%/unpack'
