# Downloaded from https://github.com/autopkg/n8felton-recipes/blob/646d469b0e6e964e0605774d8541ce29912b9207/Microsoft/Microsoft Remote Desktop Beta.munki.recipe
# Commit: 646d469b0e6e964e0605774d8541ce29912b9207
# Downloaded at: 2025-11-27 22:31:52 UTC

Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Microsoft Remote Desktop Beta and imports it into Munki.
Identifier: com.github.n8felton.munki.MicrosoftRemoteDesktopBeta
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: Microsoft Remote Desktop Beta
  pkginfo:
    catalogs:
    - testing
    description: Connect to Windows machines.
    developer: Microsoft Corporation
    display_name: Microsoft Remote Desktop Beta
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 1.0.0
ParentRecipe: com.github.n8felton.download.MicrosoftRemoteDesktopBeta
Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
