# Downloaded from https://github.com/autopkg/n8felton-recipes/blob/646d469b0e6e964e0605774d8541ce29912b9207/Microsoft/Microsoft Remote Desktop Beta.download.recipe
# Commit: 646d469b0e6e964e0605774d8541ce29912b9207
# Downloaded at: 2025-11-27 22:31:52 UTC

Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Microsoft Remote Desktop Beta.
Identifier: com.github.n8felton.download.MicrosoftRemoteDesktopBeta
Input:
  NAME: Microsoft Remote Desktop Beta
  SPARKLE_FEED_URL: https://api.appcenter.ms/v0.1/public/sparkle/apps/5e0c1442-89a5-1fca-2d3b-fa39ce7f2b06
MinimumVersion: 1.0.0
Process:
- Processor: SparkleUpdateInfoProvider
  Arguments:
    appcast_url: '%SPARKLE_FEED_URL%'
    urlencode_path_component: false
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%-%version%.zip'
- Processor: EndOfCheckPhase
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/Windows App Beta.app'
    requirement: identifier "com.microsoft.rdc.osx.beta" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9
