# Downloaded from https://github.com/autopkg/n8felton-recipes/blob/646d469b0e6e964e0605774d8541ce29912b9207/Microsoft/Microsoft Remote Desktop Beta.install.recipe
# Commit: 646d469b0e6e964e0605774d8541ce29912b9207
# Downloaded at: 2025-11-27 22:31:52 UTC

Comment: Created with Recipe Robot v1.0.5 (https://github.com/homebysix/recipe-robot)
Description: Installs the latest version of Microsoft Remote Desktop Beta.
Identifier: com.github.n8felton.install.MicrosoftRemoteDesktopBeta
Input:
  NAME: Microsoft Remote Desktop Beta
MinimumVersion: 1.0.0
ParentRecipe: com.github.n8felton.download.MicrosoftRemoteDesktopBeta
Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'
- Processor: InstallFromDMG
  Arguments:
    dmg_path: '%dmg_path%'
    items_to_copy:
    - destination_path: /Applications
      source_item: Windows App Beta.app
