# Downloaded from https://github.com/autopkg/andredb90-recipes/blob/b086f2d096ab3b53a4c2f5db7c6ec60ba3437ab5/Garmin Express/GarminExpress.filewave.recipe
# Commit: b086f2d096ab3b53a4c2f5db7c6ec60ba3437ab5
# Downloaded at: 2025-11-27 22:30:34 UTC

Description: Downloads the current release version of the Garmin Express installer package and imports it into FileWave.
Identifier: com.github.andredb90.filewave.GarminExpress
Input:
  NAME: Garmin Express
  fw_app_bundle_id: com.garmin.renu.client
MinimumVersion: 1.0.0
ParentRecipe: com.github.andredb90.pkg.GarminExpress
Process:
- Processor: com.github.autopkg.filewave.FWTool/FileWaveImporter
  Arguments:
    fw_app_bundle_id: '%fw_app_bundle_id%'
    fw_app_version: '%version%'
    fw_fileset_name: '%NAME% - %version%'
    fw_import_source: '%pkg_path%'
