# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/MicrosoftWindowsApp/MicrosoftWindowsApp.pkg.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:28:29 UTC

Description: Downloads the latest version of Microsoft's Windows App installer package and renames the package.
Identifier: com.github.rtrouton.pkg.microsoftwindowsapp
Input:
  NAME: Microsoft Windows App
  VENDOR: Microsoft
  SOFTWARETITLE1: Windows
  SOFTWARETITLE2: App
  VERSIONTYPE: CFBundleShortVersionString
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.microsoftwindowsapp
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/unpack'
    flat_pkg_path: '%pathname%'
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/downloads/unpack/*rdc*.pkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/downloads/payload'
    pkg_payload_path: '%found_filename%/Payload'
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/downloads/payload/Windows App.app/Contents/Info.plist'
    plist_version_key: '%VERSIONTYPE%'
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%'
    pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE1%_%SOFTWARETITLE2%_%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/downloads/unpack'
    - '%RECIPE_CACHE_DIR%/downloads/payload'
