# Downloaded from https://github.com/autopkg/hjuutilainen-recipes/blob/8d90cc0aa349ce751f86654504fea964ee2c3f12/GIMP/GIMP.download.recipe
# Commit: 8d90cc0aa349ce751f86654504fea964ee2c3f12
# Downloaded at: 2025-11-27 22:30:38 UTC

Description: "Downloads the latest version of GIMP from gimp.org.\n\nThis recipe supports two architecture values:\n\t- x86_64\n\t- arm64"
Identifier: io.github.hjuutilainen.download.GIMP
Input:
  NAME: GIMP
  ARCH: x86_64
MinimumVersion: 1.0.4
Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: (//download\.gimp\.org/gimp/v[0-9\.]*/macos/gimp-[0-9\.\-]*-%ARCH%(-1)?\.dmg)
    url: https://www.gimp.org/downloads/
- Processor: URLDownloader
  Arguments:
    url: https:%match%
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/GIMP*.app'
    requirement: identifier "org.gimp.gimp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = T25BQ8HSJF
    strict_verification: true
