# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Sublime HQ/Sublime Merge.pkg.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:29:28 UTC

Comment: Created with Recipe Robot v1.1.3 (https://github.com/homebysix/recipe-robot)
Description: Downloads the latest version of Sublime Merge and creates a package.
Identifier: com.github.homebysix.pkg.SublimeMerge
Input:
  NAME: Sublime Merge
MinimumVersion: 1.0.0
ParentRecipe: com.github.homebysix.download.SublimeMerge
Process:
- Processor: AppPkgCreator
  Arguments:
    app_path: '%RECIPE_CACHE_DIR%/%NAME%/Sublime Merge.app'
