# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/Audacity/Audacity.download.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:31:01 UTC

Description: "Downloads the latest version of Audacity.\n\nSet the ARCHITECTURE variable to \"x86_64\" for Intel\n\nSet the ARCHITECTURE variable to \"arm64\" for Apple Silicone\n\nSet the ARCHITECTURE variable to \"universal\" for universal\n\nSet PRERELEASE to a non-empty string to download prereleases, either\nvia Input in an override or via the -k option,\ni.e.: `-k PRERELEASE=yes`"
Identifier: com.github.dataJAR-recipes.download.Audacity
Input:
  NAME: Audacity
  ARCHITECTURE: x86_64
  PRERELEASE: ''
MinimumVersion: 1.1.0
Process:
- Processor: GitHubReleasesInfoProvider
  Arguments:
    asset_regex: audacity-macOS-(\d(\.\d)+)-%ARCHITECTURE%\.dmg
    github_repo: audacity/audacity
    include_prereleases: '%PRERELEASE%'
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Audacity.app'
    requirement: identifier "org.audacityteam.audacity" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = AWEYX923UX
