Description: Obtain upstream Barco recipe from autopkg/moofit-recipes

Identifier: com.github.anywhereops.vendorer.Barco

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/moofit-recipes
      folder_path: Barco
      commit_sha: 984f1b980c6a7ecc26402693543b0f1f9100b529
      destination_path: Barco
      recipe_type: munki
