Description: Obtain upstream DellDisplayAndPeripheralManager recipe from autopkg/grahampugh-recipes

Identifier: com.github.anywhereops.vendorer.DellDisplayAndPeripheralManager

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/grahampugh-recipes
      folder_path: DellDisplayAndPeripheralManager
      commit_sha: efb3512b57ba07bdf23c9f7f800236911a81b295
      destination_path: DellDisplayAndPeripheralManager
      recipe_type: download
      required_license: Apache-2.0
