Description: Obtain upstream Dropbox recipe from autopkg/recipes

Identifier: com.github.anywhereops.vendorer.Dropbox

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/recipes
      folder_path: Dropbox
      commit_sha: 4aa2d9380d7f8ba54af95915c8c47a73fcf88acf
      destination_path: Dropbox
      recipe_type: munki
      required_license: Apache-2.0
