Description: Obtain upstream EndNote recipe from autopkg/rtrouton-recipes

Identifier: com.github.anywhereops.vendorer.EndNote

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/rtrouton-recipes
      folder_path: EndNote
      commit_sha: 90eb2447addd20cddc99e28709d274c79cc9fe55
      destination_path: EndNote
      recipe_type: download
      required_license: MIT
