Description: Obtain upstream Mendeley recipe from autopkg/hansen-m-recipes

Identifier: com.github.anywhereops.vendorer.Mendeley

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/hansen-m-recipes
      folder_path: Mendeley
      commit_sha: de17d7db2537ffa00c27281a392f37fe599efdca
      destination_path: Mendeley
      recipe_type: munki
