Description: Obtain upstream Poly Lens Desktop recipe from autopkg/dataJAR-recipes

Identifier: com.github.anywhereops.vendorer.PolyLensDesktop

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/dataJAR-recipes
      folder_path: Poly Lens Desktop
      commit_sha: b215938ed2a542b52fb1ff552649b6b99ffe155b
      destination_path: Poly Lens Desktop
      recipe_type: munki
      required_license: Apache-2.0
