Description: Obtain upstream RStudio recipe from autopkg/hansen-m-recipes

Identifier: com.github.anywhereops.vendorer.RStudio

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/hansen-m-recipes
      folder_path: RStudio
      commit_sha: de17d7db2537ffa00c27281a392f37fe599efdca
      destination_path: RStudio
      recipe_type: munki
