Description: Obtain upstream Splashtop SOS recipe from autopkg/dataJAR-recipes

Identifier: com.github.anywhereops.vendorer.SplashtopSOS

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/dataJAR-recipes
      folder_path: Splashtop SOS
      commit_sha: b215938ed2a542b52fb1ff552649b6b99ffe155b
      destination_path: Splashtop SOS
      recipe_type: munki
      required_license: Apache-2.0
