Description: Obtain upstream SPSS Statistics recipe from autopkg/MLBZ521-recipes

Identifier: com.github.anywhereops.vendorer.SPSSStatistics

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/MLBZ521-recipes
      folder_path: SPSS Statistics
      commit_sha: 8b7738eed4c2f8b6b32a897907ee3420fa0c74ef
      destination_path: SPSS Statistics
      recipe_type: download
      required_license: MIT
