Description: Obtain upstream Unity3D recipe from autopkg/hansen-m-recipes

Identifier: com.github.anywhereops.vendorer.Unity3D

MinimumVersion: '2.3'

Input: {}

Process:
  - Processor: AutopkgVendorer
    Arguments:
      github_repo: autopkg/hansen-m-recipes
      folder_path: Unity3D
      commit_sha: de17d7db2537ffa00c27281a392f37fe599efdca
      destination_path: Unity3D
      recipe_type: munki
