# Downloaded from https://github.com/autopkg/MLBZ521-recipes/blob/8b7738eed4c2f8b6b32a897907ee3420fa0c74ef/BeyondTrust_Bomgar/Bomgar Rep Console.pkg.recipe
# Commit: 8b7738eed4c2f8b6b32a897907ee3420fa0c74ef
# Downloaded at: 2025-11-27 22:25:57 UTC

Description: "Downloads and packages the latest verison of Bomgar Console from a local file share.\n\nYou will need to provide your identifier for the CodeSignatureVerifier processor as it is unique to your orgnization.\n\nThe name of the bundled application and the package will be named based on the NAME substituion variable.\n(I personally do not desire the giantly long name of the default .app bundle.)"
Identifier: com.github.mlbz521.pkg.BomgarConsole
Input:
  NAME: Bomgar Console
ParentRecipe: com.github.mlbz521.download.BomgarConsole
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
    pkgdirs:
      Applications: '0775'
- Processor: Copier
  Arguments:
    source_path: '%found_filename%/*.app'
    destination_path: '%pkgroot%/Applications/%NAME%.app'
- Processor: PkgCreator
  Arguments:
    pkg_request:
      pkgname: '%NAME%-%version%'
      version: '%version%'
      id: '%bundleid%'
      options: purge_ds_store
      chown:
      - path: Applications
        user: root
        group: admin
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
