# Downloaded from https://github.com/autopkg/hjuutilainen-recipes/blob/8d90cc0aa349ce751f86654504fea964ee2c3f12/CitrixReceiver/CitrixReceiver.install.recipe
# Commit: 8d90cc0aa349ce751f86654504fea964ee2c3f12
# Downloaded at: 2025-11-27 22:26:13 UTC

Description: Installs the current release version of CitrixReceiver.
Identifier: io.github.hjuutilainen.install.CitrixReceiver
Input: {}
MinimumVersion: 0.4.0
ParentRecipe: io.github.hjuutilainen.download.CitrixReceiver
Process:
- Processor: Installer
