# Downloaded from https://github.com/autopkg/hjuutilainen-recipes/blob/8d90cc0aa349ce751f86654504fea964ee2c3f12/CitrixReceiver/CitrixWorkspace.download.recipe
# Commit: 8d90cc0aa349ce751f86654504fea964ee2c3f12
# Downloaded at: 2025-11-27 22:26:14 UTC

Description: Downloads the latest Citrix Workspace disk image.
Identifier: io.github.hjuutilainen.download.CitrixWorkspace
Input:
  NAME: CitrixWorkspace
MinimumVersion: 0.3.1
Process:
- Processor: URLTextSearcher
  Arguments:
    url: https://www.citrix.com/downloads/workspace-app/mac/workspace-app-for-mac-latest.html
    re_pattern: (?P<DYNAMIC_URL>//downloads.citrix.com/[\d]+/CitrixWorkspaceApp\.dmg\?__gda__\=[\w]+\=[\w]+\~[\w]+\=/\*\~[\w]+\=[\w]+)
    request_headers:
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 14_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.0 Safari/605.1.15
- Processor: URLDownloader
  Arguments:
    url: https:%DYNAMIC_URL%
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Install Citrix Workspace.pkg'
    expected_authority_names:
    - 'Developer ID Installer: Citrix Systems, Inc. (S272Y5R93J)'
    - Developer ID Certification Authority
    - Apple Root CA
