# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/Meta Quest Remote Desktop/Meta Quest Remote Desktop.download.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:29:51 UTC

Description: Downloads the latest version of Meta Quest Remote Desktop.
Identifier: com.github.dataJAR-recipes.download.Meta Quest Remote Desktop
Input:
  NAME: MetaQuestRemoteDesktop
MinimumVersion: '1.1'
Process:
- Processor: URLTextSearcher
  Arguments:
    re_pattern: https://www.oculus.com/download_app/\?id=[0-9]+
    request_headers:
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.4 Safari/605.1.15
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,*/*;q=0.8
      Accept-Language: en-GB,en;q=0.9
      Cookie: locale=en_GB
      Sec-Fetch-Site: none
      Sec-Fetch-Mode: navigate
      Sec-Fetch-Dest: document
    curl_opts:
    - --compressed
    - --location
    result_output_var_name: DOWNLOAD_URL
    url: https://www.meta.com/en-gb/help/quest/569381194082673/
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.pkg'
    url: '%DOWNLOAD_URL%'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
    - 'Developer ID Installer: Facebook Technologies, LLC (HXH6UQBHD4)'
    - Developer ID Certification Authority
    - Apple Root CA
