# Downloaded from https://github.com/autopkg/MLBZ521-recipes/blob/8b7738eed4c2f8b6b32a897907ee3420fa0c74ef/SPSS Statistics/SPSSStatisticsLegacy.download.recipe
# Commit: 8b7738eed4c2f8b6b32a897907ee3420fa0c74ef
# Downloaded at: 2025-11-27 22:31:11 UTC

Description: "Downloads the latest or a specified verison of SPSS Statistics from a local file share.\n\nTested on versions of SPSS 26 and older."
Identifier: com.github.mlbz521.download.SPSSStatisticsLegacy
Input:
  NAME: SPSS Statistics
  SEARCH_STRING: SPSS
  MAJOR_VERSION: ''
  NAME_LIMITATION: ''
  NAME_EXCEPTION: ''
  FILE_SHARE: /path/to/offline/repository
  VERSION_STRING_SEPARATOR: '-'
  MAX_FOLDER_DEPTH: '1'
Process:
- Processor: com.github.mlbz521.SharedProcessors/OfflineApps
  Arguments:
    search_path: '%FILE_SHARE%'
    search_string: '%SEARCH_STRING%'
    major_version: '%MAJOR_VERSION%'
    exception_string: '%NAME_EXCEPTION%'
    limitation_string: '%NAME_LIMITATION%'
    version_separator: '%VERSION_STRING_SEPARATOR%'
    max_depth: '%MAX_FOLDER_DEPTH%'
- Processor: FileFinder
  Arguments:
    pattern: '%cached_path%/*.dmg'
- Processor: EndOfCheckPhase
