# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/Snagit/Snagit.download.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:29:23 UTC

Description: Downloads the latest version of Snagit.
Identifier: com.github.dataJAR-recipes.download.Snagit
Input:
  NAME: Snagit
MinimumVersion: '1.1'
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: https://download.techsmith.com/snagitmac/releases/Snagit.dmg
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Snagit.app'
    requirement: anchor apple generic and identifier "com.TechSmith.Snagit" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7TQL462TU8")
