# Downloaded from https://github.com/autopkg/ahousseini-recipes/blob/31e6138b990db5622ef2f3ab05d541edcf92997e/PrusaSlicer/PrusaSlicer.download.recipe
# Commit: 31e6138b990db5622ef2f3ab05d541edcf92997e
# Downloaded at: 2025-11-27 22:30:46 UTC

Identifier: com.github.ahousseini-recipes.download.PrusaSlicer
Input:
  NAME: PrusaSlicer
MinimumVersion: 1.0.0
Process:
- Processor: com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL
  Arguments:
    cask_name: prusaslicer
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Original Prusa Drivers/PrusaSlicer.app'
    requirement: identifier "com.prusa3d.slic3r/" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DKPB65N43Z
