# Downloaded from https://github.com/autopkg/joshua-d-miller-recipes/blob/8a1767feebc676e376cc661d05f092c654217ce1/Zotero/Zotero.download.recipe
# Commit: 8a1767feebc676e376cc661d05f092c654217ce1
# Downloaded at: 2025-11-27 22:33:19 UTC

Description: Downloads the latest verison of Zotero
Identifier: com.github.joshua-d-miller.download.zotero
Input:
  NAME: Zotero
MinimumVersion: 0.3.1
Process:
- Processor: URLTextSearcher
  Arguments:
    url: https://www.zotero.org/download/
    re_pattern: \"mac\":\"(.*?)\",
- Processor: URLDownloader
  Arguments:
    url: https://www.zotero.org/download/client/dl?channel=release&platform=mac&version=%match%
    filename: '%NAME%.dmg'
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Zotero.app'
    requirement: identifier "org.zotero.zotero" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8LAYR367YV"
