# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/PolyLens/PolyLens.pkg.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:27:53 UTC

Description: Downloads the latest version of Poly Lens and renames its installer package.
Identifier: com.github.rtrouton.pkg.polylens
Input:
  NAME: Poly Lens
  VENDOR: Poly
  SOFTWARETITLE: Lens
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.polylens
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    flat_pkg_path: '%pathname%/*.pkg'
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
- Processor: FileFinder
  Arguments:
    pattern: '%RECIPE_CACHE_DIR%/unpack/*.pkg'
- Processor: PkgPayloadUnpacker
  Arguments:
    pkg_payload_path: '%found_filename%/Payload'
    extract_root: '%RECIPE_CACHE_DIR%/unpack/Payload'
- Processor: PlistReader
  Arguments:
    info_path: '%RECIPE_CACHE_DIR%/unpack/Applications/Lens Desktop.app/Contents/Info.plist'
    plist_keys:
      CFBundleVersion: version
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%/*.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/unpack'
