# Downloaded from https://github.com/autopkg/jc0b-recipes/blob/2db4a7c0ef51fe76b46c23ef1f4c1f025deac181/TalkDesk/Talkdesk.munki.recipe.yaml
# Commit: 2db4a7c0ef51fe76b46c23ef1f4c1f025deac181
# Downloaded at: 2025-11-27 22:31:25 UTC

Description: Downloads the latest versions of Talkdesk, and imports it into Munki.
Identifier: com.github.jc0b.munki.Talkdesk
ParentRecipe: com.github.jc0b.download.Talkdesk
MinimumVersion: '2.3'

Input:
  NAME: Talkdesk
  MUNKI_REPO_SUBDIR: talkdesk/talkdesk
  pkginfo:
    catalogs:
      - testing
    description: Talkdesk is a global cloud contact center leader for modern AI-powered customer service that is trusted, flexible, and innovative.
    developer: Talkdesk, Inc
    name: "%NAME%"
    unattended_install: true
    unattended_uninstall: true

Process:
  - Processor: MunkiImporter
    Arguments:
      extract_icon: true
      pkg_path: "%pathname%"
      repo_subdirectory: "%MUNKI_REPO_SUBDIR%"