# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/GoTo/GoTo.download.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:31:35 UTC

Description: "Downloads the latest version of GoTo.\n\nTo download the Apple Silicon version use \"-arm64\" in the ARCH_TYPE variable.\nTo download the Intel Version leave the ARCH_TYPE variable empty."
Identifier: com.github.dataJAR-recipes.download.GoTo
Input:
  NAME: GoTo
  ARCH_TYPE: ''
MinimumVersion: '2.7'
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.tgz'
    url: https://goto-desktop.getgo.com/GoTo%ARCH_TYPE%-mac.tar.gz
- Processor: EndOfCheckPhase
- Processor: Unarchiver
  Arguments:
    archive_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/%NAME%'
    purge_destination: true
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%RECIPE_CACHE_DIR%/%NAME%/GoTo.app'
    requirement: identifier "com.logmein.goto" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = GFNFVT632V
