# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/GoTo/GoTo.munki.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:31:35 UTC

Description: "Downloads the latest version of GoTo and imports it into Munki.\n\nFor Intel use: \"x86_64\" in the SUPPORTED_ARCH variable\nFor Apple Silicon use: \"arm64\" in the SUPPORTED_ARCH variable"
Identifier: com.github.dataJAR-recipes.munki.GoTo
Input:
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: GoTo
  SUPPORTED_ARCH: ''
  pkginfo:
    catalogs:
    - testing
    description: Online meeting, desktop sharing, and video conferencing software.
    developer: LogMeIn, Inc.
    display_name: GoTo
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: '2.7'
ParentRecipe: com.github.dataJAR-recipes.download.GoTo
Process:
- Processor: DmgCreator
  Arguments:
    dmg_path: '%RECIPE_CACHE_DIR%/%NAME%.dmg'
    dmg_root: '%RECIPE_CACHE_DIR%/%NAME%'
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%dmg_path%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/%NAME%'
