# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Wireshark/Wireshark.pkg.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:29:38 UTC

Description: Downloads the latest version of Wireshark and builds a pkg.
Identifier: com.github.homebysix.pkg.Wireshark
Input:
  NAME: Wireshark
MinimumVersion: 0.4.0
ParentRecipe: com.github.homebysix.download.Wireshark
Process:
- Processor: AppDmgVersioner
  Arguments:
    dmg_path: '%pathname%'
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/%NAME%'
- Processor: Copier
  Arguments:
    destination_path: '%pkgroot%/Applications/Wireshark.app'
    source_path: '%pathname%/Wireshark.app'
- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: org.wireshark.Wireshark.pkg
      pkgdir: '%RECIPE_CACHE_DIR%'
      pkgname: '%NAME%-%version%'
