# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Wireshark/WiresharkDev.install.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:29:38 UTC

Description: Downloads the latest version of Wireshark Dev and builds a pkg, installs it.
Identifier: com.github.homebysix.install.WiresharkDev
Input: {}
MinimumVersion: 0.4.0
ParentRecipe: com.justinrummel.pkg.WiresharkDev
Process:
- Processor: Installer
