# Downloaded from https://github.com/autopkg/homebysix-recipes/blob/26f97759822c6c90b8f458f35b82ff9496785c71/Vivaldi/Vivaldi.munki.recipe
# Commit: 26f97759822c6c90b8f458f35b82ff9496785c71
# Downloaded at: 2025-11-27 22:33:15 UTC

Description: Downloads the latest Vivaldi disk image and imports into Munki.
Identifier: com.github.homebysix.munki.Vivaldi
Input:
  MUNKI_REPO_SUBDIR: apps
  NAME: Vivaldi
  pkginfo:
    catalogs:
    - testing
    category: Productivity
    description: A browser for our friends.
    developer: Vivaldi Technologies
    name: '%NAME%'
    unattended_install: true
    unattended_uninstall: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.homebysix.download.Vivaldi
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
