# Downloaded from https://github.com/autopkg/blackthroat-recipes/blob/553de847ae0637b40824192de99c4cd09e8c42ae/Plantronics, Inc./PlantronicsHub.pkg.recipe
# Commit: 553de847ae0637b40824192de99c4cd09e8c42ae
# Downloaded at: 2025-11-27 22:29:55 UTC

Description: Downloads the latest version of Plantronics Hub and creates a package.
Identifier: com.github.blackthroat.pkg.PlantronicsHub
Input:
  NAME: PlantronicsHub
MinimumVersion: 1.0.0
ParentRecipe: com.github.blackthroat.download.PlantronicsHub
Process:
- Processor: FlatPkgUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/unpack'
    flat_pkg_path: '%pathname%/Plantronics Software.pkg'
    purge_destination: true
- Processor: PkgPayloadUnpacker
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/Applications/Plantronics Hub.app'
    pkg_payload_path: '%RECIPE_CACHE_DIR%/unpack/inner.pkg/Payload'
    purge_destination: true
- Processor: Versioner
  Arguments:
    input_plist_path: '%destination_path%/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: PkgCopier
  Arguments:
    source_pkg: '%pathname%/Plantronics Software.pkg'
    pkg_path: '%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/Applications'
    - '%RECIPE_CACHE_DIR%/unpack'
