# Downloaded from https://github.com/autopkg/dataJAR-recipes/blob/b215938ed2a542b52fb1ff552649b6b99ffe155b/DBeaver Community Edition/DBeaver Community Edition.munki.recipe
# Commit: b215938ed2a542b52fb1ff552649b6b99ffe155b
# Downloaded at: 2025-11-27 22:26:18 UTC

Description: Imports DBeaver Community Edition into Munki.
Identifier: com.github.dataJAR-recipes.munki.DBeaver Community Edition
Input:
  APP_FILENAME: DBeaver
  MUNKI_REPO_SUBDIR: apps/%NAME%
  NAME: DBeaver Community Edition
  os: macos
  pkginfo:
    catalogs:
    - testing
    description: 'Free multi-platform database tool for developers, SQL programmers, database administrators and analysts. Supports all popular databases: MySQL, PostgreSQL, MariaDB, SQLite, Oracle, DB2, SQL Server, Sybase, MS Access, Teradata, Firebird, Derby, etc.'
    developer: DBeaver Corp
    display_name: DBeaver Community Edition
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 1.0.0
ParentRecipe: com.github.peshay.download.DBeaverCE
Process:
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/DBeaver.app'
    requirement: identifier "org.jkiss.dbeaver.core.product" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "42B6MDKMW8"
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
