# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/AdobeCreativeCloud/AdobeCreativeCloudInstallerUniversal.install.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:25:39 UTC

Description: Downloads the latest version of Adobe's Creative Cloud Installer, builds an installer package which installs the correct Creative Cloud for your Mac's processor and installs the the correct Creative Cloud for your Mac's processor.
Identifier: com.github.rtrouton.install.AdobeCreativeCloudInstallerUniversal
Input:
  NAME: Creative Cloud Installer
  VENDOR: Adobe
  SOFTWARETITLE: Creative Cloud Installer
  NAMEWITHOUTSPACES: CreativeCloudInstaller
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.pkg.AdobeCreativeCloudInstallerUniversal
Process:
- Processor: Installer
