# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/AdobeCreativeCloud/AdobeCreativeCloudInstallerAppleSilicon.pkg.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:25:39 UTC

Description: Downloads the latest version of Adobe's Creative Cloud Desktop App Installer and packages it for installation.
Identifier: com.github.rtrouton.pkg.AdobeCreativeCloudInstallerAppleSilicon
Input:
  NAME: Creative Cloud Installer
  VENDOR: Adobe
  SOFTWARETITLE: Creative Cloud Installer
  NAMEWITHOUTSPACES: CreativeCloudInstaller
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.AdobeCreativeCloudInstallerAppleSilicon
Process:
- Processor: PkgRootCreator
  Arguments:
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
    pkgdirs: {}
- Processor: PkgRootCreator
  Arguments:
    pkgdirs: {}
    pkgroot: '%RECIPE_CACHE_DIR%/Scripts'
- Processor: Copier
  Arguments:
    source_path: '%pathname%/packages/ApplicationInfo.xml'
    destination_path: '%RECIPE_CACHE_DIR%/ApplicationInfo.xml'
    overwrite: true
- Processor: XMLReader
  Arguments:
    xml_path: '%RECIPE_CACHE_DIR%/ApplicationInfo.xml'
    elements:
    - xpath: version
      text: version
- Processor: Copier
  Arguments:
    source_path: '%pathname%'
    destination_path: '%RECIPE_CACHE_DIR%/Scripts/%VENDOR%%NAMEWITHOUTSPACES%-%version%.dmg'
    overwrite: true
- Processor: FileCreator
  Arguments:
    file_path: '%RECIPE_CACHE_DIR%/Scripts/postinstall'
    file_mode: '0755'
    file_content: "#!/bin/bash\n\t\t\t\t\n# Determine working directory\ninstallDir=$(dirname $0)\ndmg=(\"${installDir}\"/*\\.dmg)\n\n# Mount the disk image to /Volumes\nmountResult=$(/usr/bin/hdiutil attach \"${dmg}\" -nobrowse -noverify -noautoopen)\nmountPoint=$(/bin/echo \"${mountResult}\" | /usr/bin/grep Volumes | /usr/bin/awk '{print substr($0, index($0,$3))}')\n\n# Install the software\n\"${mountPoint}/Install.app/Contents/MacOS/Install\" --mode=silent\n\n# Get the exit code so we can fail properly\nexitcode=$?\n\n# Unmount the disk image from /Volumes\n/usr/bin/hdiutil detach \"${mountPoint}\"\n\n# Exit according to whether the install succeeded or not\nexit \"${exitcode}\"\n"
- Processor: PkgCreator
  Arguments:
    pkg_request:
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgname: '%VENDOR%%NAMEWITHOUTSPACES%-AppleSilicon-%version%'
      pkgtype: flat
      id: com.adobe.AdobeCreativeCloudInstallerAppleSilicon.pkg
      version: '%version%'
      scripts: Scripts
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/pkgroot'
    - '%RECIPE_CACHE_DIR%/Scripts'
    - '%RECIPE_CACHE_DIR%/ApplicationInfo.xml'
