# Downloaded from https://github.com/autopkg/rustymyers-recipes/blob/7ce7904e3e5bf5c5ed64da5ba61c9a1bb082891a/Dedoose/Dedoose.download.recipe.yaml
# Commit: 7ce7904e3e5bf5c5ed64da5ba61c9a1bb082891a
# Downloaded at: 2025-11-27 22:26:22 UTC

Description: Downloads Dedoose for macOS
Identifier: com.github.rustymyers.download.Dedoose
MinimumVersion: 0.2.9
# Regex Testing https://regex101.com/r/TSk9hK/1
Input:
  NAME: Dedoose
  SEARCH_URL: https://www.dedoose.com/resources/articledetail/dedoose-desktop-app
  SEARCH_PATTERN: (?P<url_match>https:\/\/downloads.*Dedoose-(?P<version>[0-9]{1,3}.[0-9]{1,3}.[0-9]{1,3}).dmg)"

Process:
  - Processor: URLTextSearcher
    Arguments:
      re_pattern: "%SEARCH_PATTERN%"
      url: "%SEARCH_URL%"

  - Processor: URLDownloader
    Arguments:
      request_headers:
        user-agent: "%USER_AGENT%"
      url: "%url_match%"

  - Processor: EndOfCheckPhase
