# Downloaded from https://github.com/autopkg/rustymyers-recipes/blob/7ce7904e3e5bf5c5ed64da5ba61c9a1bb082891a/Dedoose/Dedoose.pkg.recipe.yaml
# Commit: 7ce7904e3e5bf5c5ed64da5ba61c9a1bb082891a
# Downloaded at: 2025-11-27 22:26:22 UTC

Description: Downloads Dedoose and makes a package.
Identifier: com.github.rustymyers.pkg.Dedoose
ParentRecipe: com.github.rustymyers.download.Dedoose
MinimumVersion: "1.0"

Input:
  NAME: Dedoose

Process:
  - Processor: AppPkgCreator
    Arguments:
      bundleid: com.github.pkg.dedoose
