# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/EndNote/EndNote2025.download.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:33:03 UTC

Description: Downloads the latest version of EndNote 2025 for Mac
Identifier: com.github.rtrouton.download.EndNote2025
Input:
  DOWNLOAD_URL: https://download.endnote.com/downloads/2025/EndNote2025Installer.dmg
  NAME: EndNote 2025
  SOFTWARETITLE1: EndNote
  SOFTWARETITLE2: '2025'
MinimumVersion: 1.0.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%SOFTWARETITLE1%%SOFTWARETITLE2%.dmg'
    url: '%DOWNLOAD_URL%'
- Processor: EndOfCheckPhase
- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Install EndNote 2025.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Install EndNote 2025.app'
    requirement: anchor apple generic and identifier "com.ThomsonResearchSoft.EndNote.Installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2Y4P62NL52")
