# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/EndNote/EndNoteX8.install.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:33:04 UTC

Description: Downloads the current release version of EndNote X8, builds a package and installs it.
Identifier: com.github.rtrouton.install.EndNoteX8
Input:
  NAME: EndNoteX8
MinimumVersion: 0.6.1
ParentRecipe: com.github.rtrouton.pkg.EndNoteX8
Process:
- Processor: Installer
