# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/EndNote/EndNoteX9.pkg.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:33:05 UTC

Description: Downloads latest Endnote X9 installer and uses it to create a package.
Identifier: com.github.rtrouton.pkg.EndNoteX9
Input:
  NAME: EndNoteX9
MinimumVersion: 1.0.0
ParentRecipe: com.github.rtrouton.download.EndNoteX9
Process:
- Processor: Copier
  Arguments:
    source_path: '%pathname%/Install EndNote X9.app/Contents/Resources/EndNote.zip'
    destination_path: '%RECIPE_CACHE_DIR%/EndNote.zip'
    purge_destination: true
- Processor: Unarchiver
  Arguments:
    archive_path: '%RECIPE_CACHE_DIR%/EndNote.zip'
    destination_path: '%RECIPE_CACHE_DIR%/unarchive'
    purge_destination: true
- Processor: Versioner
  Arguments:
    input_plist_path: '%RECIPE_CACHE_DIR%/unarchive/EndNote/EndNote X9.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: PkgRootCreator
  Arguments:
    pkgdirs:
      Applications: '0775'
    pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
- Processor: Copier
  Arguments:
    destination_path: '%RECIPE_CACHE_DIR%/pkgroot/Applications/EndNote X9'
    source_path: '%RECIPE_CACHE_DIR%/unarchive/EndNote'
- Processor: PkgCreator
  Arguments:
    pkg_request:
      chown:
      - group: admin
        path: Applications
        user: root
      id: com.endnote.EndNoteX9.pkg
      pkgname: EndNoteX9-%version%
      pkgroot: '%RECIPE_CACHE_DIR%/pkgroot'
      pkgtype: flat
      version: '%version%'
- Processor: PathDeleter
  Arguments:
    path_list:
    - '%RECIPE_CACHE_DIR%/EndNote.zip'
    - '%RECIPE_CACHE_DIR%/unarchive'
    - '%RECIPE_CACHE_DIR%/pkgroot'
