# Downloaded from https://github.com/autopkg/rtrouton-recipes/blob/90eb2447addd20cddc99e28709d274c79cc9fe55/EndNote/EndNoteX9.download.recipe
# Commit: 90eb2447addd20cddc99e28709d274c79cc9fe55
# Downloaded at: 2025-11-27 22:33:04 UTC

Description: Downloads the latest version of EndNote X9
Identifier: com.github.rtrouton.download.EndNoteX9
Input:
  DOWNLOAD_URL: https://download.endnote.com/downloads/X9/EndNoteX9Installer.dmg
  NAME: EndNoteX9
MinimumVersion: 1.0.0
Process:
- Processor: URLDownloader
  Arguments:
    filename: '%NAME%.dmg'
    url: '%DOWNLOAD_URL%'
- Processor: EndOfCheckPhase
- Processor: Versioner
  Arguments:
    input_plist_path: '%pathname%/Install EndNote X9.app/Contents/Info.plist'
    plist_version_key: CFBundleShortVersionString
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/Install EndNote X9.app'
    requirement: anchor apple generic and identifier "com.ThomsonResearchSoft.EndNote.Installer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2Y4P62NL52")
