# Downloaded from https://github.com/autopkg/aws-recipes/blob/78a69905e70ea3f34e5ca19495c17a8c4ad93af0/Corretto/AmazonCorrettoJDK.download.recipe
# Commit: 78a69905e70ea3f34e5ca19495c17a8c4ad93af0
# Downloaded at: 2025-11-27 22:25:45 UTC

Description: Downloads the latest version of Amazon Corretto JDK. Requires ARCH (x64 [Intel], or aarch64 [Apple Silicon]) and MAJOR_VERSION (8,11,17,18).
Identifier: com.amazon.aws.download.amazoncorretto
Input:
  NAME: Amazon Corretto %MAJOR_VERSION%
  MAJOR_VERSION: '8'
  ARCH: x64
MinimumVersion: 1.4.0
Process:
- Processor: CorrettoURLProvider
  Arguments:
    architecture: '%ARCH%'
    major_version: '%MAJOR_VERSION%'
- Processor: URLDownloader
- Processor: EndOfCheckPhase
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%'
    expected_authority_names:
    - 'Developer ID Installer: AMZN Mobile LLC (94KV3E626L)'
    - Developer ID Certification Authority
    - Apple Root CA
