# Downloaded from https://github.com/autopkg/bnpl-recipes/blob/90d8fb437cb2819f34487c26eb7b68928bfb079b/JetBrains/CLion.munki.recipe
# Commit: 90d8fb437cb2819f34487c26eb7b68928bfb079b
# Downloaded at: 2025-11-27 22:28:01 UTC

Description: Downloads the current release version of CLion and imports into Munki.
Comment: For the SUPPORTED_ARCH variable use "x86_64" for Intel, use "arm64" for Apple Silicon
Identifier: com.github.bnpl.autopkg.munki.clion
Input:
  NAME: CLion
  MUNKI_REPO_SUBDIR: apps/jetbrains
  SUPPORTED_ARCH: x86_64
  pkginfo:
    catalogs:
    - testing
    category: Developer Tools
    description: "A smart cross-platform IDE for C and C++\n\nhttps://www.jetbrains.com/clion"
    developer: JetBrains
    display_name: CLion
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
    uninstallable: true
MinimumVersion: 0.4.3
ParentRecipe: com.github.bnpl.autopkg.download.clion
Process:
- Processor: MunkiImporter
  Arguments:
    munkiimport_appname: CLion.app
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
