# Downloaded from https://github.com/autopkg/its-unibas-recipes/blob/c5bd8a6d2cafa6e81e67f6aec19d2a11dd77de2c/JetBrains/Intellij.munki.recipe
# Commit: c5bd8a6d2cafa6e81e67f6aec19d2a11dd77de2c
# Downloaded at: 2025-11-27 22:28:51 UTC

Description: "Downloads the latest Intellij disk image and imports into Munki.\nDefaults to the Intellij Community Edition for intel architecture. Override the following keys for other versions:\nFor macOS Silicon: \n    - arch == \"aarch64\"\nFor IntelliJ Ultimate Edition: \n    - CODESIGNATUREAPPNAME == \"IntelliJ IDEA.app\"\n    - CODESIGNATUREREQUIREMENT == \"identifier \"com.jetbrains.intellij\" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = \"2ZEFAR8TH3\"\"\n    - edition == \"U\""
Identifier: com.github.its-unibas.munki.Intellij
Input:
  arch: intel
  MUNKI_REPO_SUBDIR: apps/JetBrains/Intellij
  NAME: Intellij
  edition: C
  pkginfo:
    catalogs:
    - testing
    category: Productivity
    description: Lightweight IDE for Java SE, Groovy and Scala development.
    developer: JetBrains
    display_name: '%NAME%'
    name: '%NAME%'
    unattended_install: true
MinimumVersion: 0.2.0
ParentRecipe: com.github.its-unibas.download.Intellij
Process:
- Processor: MunkiImporter
  Arguments:
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
