# Downloaded from https://github.com/autopkg/bnpl-recipes/blob/90d8fb437cb2819f34487c26eb7b68928bfb079b/JetBrains/IntelliJ-IDEA-UE.munki.recipe
# Commit: 90d8fb437cb2819f34487c26eb7b68928bfb079b
# Downloaded at: 2025-11-27 22:28:02 UTC

Description: Downloads the current release version of IntelliJ IDEA Ultimate Edition and imports into Munki.
Comment: For the SUPPORTED_ARCH variable use "x86_64" for Intel, use "arm64" for Apple Silicon
Identifier: com.github.bnpl.autopkg.munki.intellijideaue
Input:
  NAME: IntelliJ IDEA Ultimate Edition
  MUNKI_REPO_SUBDIR: apps/jetbrains
  SUPPORTED_ARCH: x86_64
  pkginfo:
    catalogs:
    - testing
    category: Developer Tools
    description: "Capable and ergonomic Java IDE\n\nhttps://www.jetbrains.com/idea"
    developer: JetBrains
    display_name: IntelliJ IDEA Ultimate Edition
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
    uninstallable: true
MinimumVersion: 0.4.3
ParentRecipe: com.github.bnpl.autopkg.download.intellijideaue
Process:
- Processor: MunkiImporter
  Arguments:
    munkiimport_appname: IntelliJ IDEA.app
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
