# Downloaded from https://github.com/autopkg/bnpl-recipes/blob/90d8fb437cb2819f34487c26eb7b68928bfb079b/JetBrains/JetBrains.download.recipe
# Commit: 90d8fb437cb2819f34487c26eb7b68928bfb079b
# Downloaded at: 2025-11-27 22:28:02 UTC

Description: Downloads the current release version of JetBrains product.
Identifier: com.github.bnpl.autopkg.download.jetbrains
Input:
  NAME: JetBrainsProductDownload
  PROD_CODE: A valid product code can be obtained from https://data.services.jetbrains.com/products
MinimumVersion: 0.2.0
Process:
- Processor: URLTextSearcher
  Arguments:
    url: https://data.services.jetbrains.com/products/releases?code=%PROD_CODE%&latest=true&type=release
    re_pattern: '"%ARCH_TYPE%":{"link":"(https://download.jetbrains.com/.*?.dmg)"'
    request_headers:
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10.11; rv:46.0) Gecko/20100101 Firefox/46.0
- Processor: URLDownloader
  Arguments:
    url: '%match%'
- Processor: EndOfCheckPhase
- Processor: FileFinder
  Arguments:
    pattern: '%pathname%/*.app'
- Processor: PlistReader
  Arguments:
    info_path: '%pathname%/%dmg_found_filename%'
    plist_keys:
      CFBundleShortVersionString: version
      LSMinimumSystemVersion: min_os_vers
- Processor: CodeSignatureVerifier
  Arguments:
    input_path: '%pathname%/%dmg_found_filename%'
    requirement: '%CSV_REQ%'
    strict_verification: true
