# Downloaded from https://github.com/autopkg/bnpl-recipes/blob/90d8fb437cb2819f34487c26eb7b68928bfb079b/JetBrains/RubyMine.munki.recipe
# Commit: 90d8fb437cb2819f34487c26eb7b68928bfb079b
# Downloaded at: 2025-11-27 22:28:04 UTC

Description: Downloads the current release version of RubyMine and imports into Munki.
Comment: For the SUPPORTED_ARCH variable use "x86_64" for Intel, use "arm64" for Apple Silicon
Identifier: com.github.bnpl.autopkg.munki.rubymine
Input:
  NAME: RubyMine
  MUNKI_REPO_SUBDIR: apps/jetbrains
  SUPPORTED_ARCH: x86_64
  pkginfo:
    catalogs:
    - testing
    category: Developer Tools
    description: "The most intelligent Ruby IDE\n\nhttps://www.jetbrains.com/ruby"
    developer: JetBrains
    display_name: RubyMine
    name: '%NAME%'
    supported_architectures:
    - '%SUPPORTED_ARCH%'
    unattended_install: true
    unattended_uninstall: true
    uninstallable: true
MinimumVersion: 0.4.3
ParentRecipe: com.github.bnpl.autopkg.download.rubymine
Process:
- Processor: MunkiImporter
  Arguments:
    munkiimport_appname: RubyMine.app
    pkg_path: '%pathname%'
    repo_subdirectory: '%MUNKI_REPO_SUBDIR%'
